package ru.skinallergic.checkskin.components.tests.data

object StringUtills {
    const val STRING_ANXIETY_0 ="Отсутствие достоверно выраженных симптомов " +
            "тревоги.\n" +
            "Отличный результат! Если жизнь и подбрасывает поводы для " +
            "беспокойства, вы легко с ними справляетесь. Запомните это " +
            "состояние! А на досуге – поразмышляйте - что дает вам возможность " +
            "чувствовать себя именно так – любимое дело, поддержка близких, " +
            "грамотное планирование… – из каких «кубиков» складывается ваше " +
            "спокойствие? В будущем, вы всегда сможете обратиться к этим " +
            "ресурсам. " +
            "Вы не тревожитесь, а настроение все равно «на нуле»? К сожалению, " +
            "так тоже бывает. Рекомендуем пройти тест на выраженность " +
            "депрессии, и получить рекомендации в описании."


    const val STRING_ANXIETY_1="Субклинически выраженная тревога.\n" +
            "«Субклинический» уровень означает, что все не так уж и плохо, но " +
            "пора заняться своим душевным здоровьем! " +
            "Возможно, в вашей жизни сейчас происходят перемены, и вас " +
            "беспокоит, как вы с ними справитесь. Скорее всего, в голове крутятся " +
            "негативные мысли, а сон стал тревожным. Подумайте, не появился ли " +
            "в вашей жизни источник хронического стресса– неудобный график " +
            "работы, нехватка сна, затянувшийся конфликт? Проанализируйте его " +
            "сами, поделитесь с близкими или привлеките специалиста. Напишите " +
            "список волнующих вас проблем и спланируйте, как вы будете их " +
            "решать – в какой последовательности и с чьей помощью. Побольше " +
            "гуляйте и двигайтесь. Начните осваивать дыхательные и " +
            "релаксационные техники. " +
            "Рекомендуем также пройти тест на наличие признаков депрессии, и " +
            "следовать рекомендациям в описании."

    const val STRING_ANXIETY_2="Клинически выраженная тревога.\n" +
            "Возможно, ранее, вы не уделили внимание усилившейся тревоге, и " +
            "она вышла из-под контроля. Вы словно все время готовитесь к чему-" +
            "то худшему, мысли бегут быстрее чем обычно, и они, в основном, " +
            "негативные. Хочется все контролировать, но тревога лишает сил. Не " +
            "пугайтесь и не расстраивайтесь, а обратитесь к психотерапевту или " +
            "психиатру, которые могут назначить вам противотревожные"


    //_DEPRESSION------------------------------------------------------------------------

    const val STRING_DEPRESSION_0 ="Отсутствие достоверно выраженных симптомов " +
            "депрессии.\n" +
            "Вы в хорошей форме и готовы получать удовольствие от жизни. В " +
            "таком состоянии хочется сделать что-нибудь хорошее для себя и для " +
            "окружающих. Непременно воспользуйтесь этим! " +
            "Подумайте - что дает вам возможность чувствовать «вкус к жизни» – " +
            "любимое дело, поддержка близких, путешествия, увлечения, " +
            "мечты…? В будущем, вы сможете обращаться к этим ресурсам для " +
            "поднятия настроения!"


    const val STRING_DEPRESSION_1="Субклинически выраженная депрессия.\n" +
            "Возможно, сейчас вы теряете работоспособность и вкус к жизни, " +
            "находитесь в состоянии хронической усталости, а в голове крутятся " +
            "негативные мысли. Многое из того, что было важно раньше, теряет " +
            "смысл. " +
            "Поделитесь переживаниями с тем, кому вы доверяете или привлеките " +
            "специалиста. Чем раньше вы позаботитесь о себе, тем быстрее " +
            "справитесь с этим состоянием. " +
            "Вам рекомендована неспешная физическая активность (плавание, " +
            "велосипед, прогулки). Включите в рацион продукты, которые " +
            "способствуют выработке эндорфинов – «Гормонов радости» - горький " +
            "шоколад, бананы, йогурт, творог, сыр, фисташки, грецкие орехи и др."

    const val STRING_DEPRESSION_2="Клинически выраженная депрессия.\n" +
            "Ваше настроение «на нуле», жизнь кажется чередой неудач, а " +
            "будущее - беспросветным. Причин у такого состояния может быть множество. Например, вы недавно перенесли острый стресс, ваша " +
            "жизнь резко изменилась, и вы не успели к ней приспособиться. " +
            "Возможно также, произошел сбой в балансе нейромедиаторов, " +
            "отвечающих за хорошее настроение. Обратитесь к психотерапевту " +
            "или психиатру, которые помогут исправить биохимические и " +
            "гормональные нарушения. На первом этапе, вам, возможно, будет " +
            "казаться, что у вас нет сил и желания ходить по врачам и вообще что-" +
            "то менять. В этом случае попросите кого-то из родственников или " +
            "знакомых взять на себя организацию встречи со специалистом."

}